app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY id ASC LIMIT 20
---
  def index
    @products = Product.order('id ASC').limit(20)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def show
    @products = Product.find(params[:id])