app/controllers/top_controller.rb

  def index
    @products = Product.order('id ASC').limit(20)
---
SELECT `products`.* FROM `products` ORDER BY id DESC LIMIT 20